Revit 2027 API
RebarShapeTerminationsData Constructor
 Creates a new instance of RebarShapeTerminationData with the default values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeTerminationsData(
	Document document
)
Public Sub New (
	document As Document
)
public:
RebarShapeTerminationsData(
	Document^ document
)
new :
        document : Document -> RebarShapeTerminationsData
Parameters
document Document
 The document containing the end treatment ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace